a = 10 # a-ին վերագչում է 10 
b = 3 # b-ին վերագրում է 3
c = a + b # c-ին վերագրում է a-ի ու b-ի գումարը՝ այսինքն 13
d = a - b # d-ին վերագրում է a-ի ու b-ի տարբերությունը՝ այսինքն 7
i = a * b # i-ին վերագրում է a-ի ու b-ի արտաֆրյալը՝ այսինքն 30 
f = a / b # f-ին վերագրում է a-ի ու b-ի քանորդը՝ այսինքն 3.3333... 
g = a // b # g-ին վերագրում է a-ի ու b-ի քանորդի ամբողջական մասը՝ այսինքն g = 10 // 3 = 3 
h = a % b # h-ին վերագրում է a-ի ու b-ի քանորդի մնացորդային մասը՝ այսինքն h = 10 - 3(10 // 3) = 1  
i = a ** b # i-ին վերագրում է a բարձրացրած b աստիճան՝ այսինքն 1000
 