f = open("1.txt", "w") # f- ին վերագրում ենք "1.txt" անունով ֆայլ, և պատրաստվում ենք գրել դրա մեջ
f.write("Hello, my name is Vardges Khachatryan") # Ավելացնում ենք նշված տեքստը
f.close() # Փակում ենք ֆայլը

f = open("1.txt", "r") # f- ին վերագրում ենք "1.txt" անունով ֆայլ, և պատրաստվում ենք կարդալ 
print(f.read()) # Ստանում ենք նշված տեքստը
f.close() # Փակում ենք ֆայլը

f = open("1.txt", "a") # f- ին վերագրում ենք "1.txt" անունով ֆայլ, և պատրաստվում ենք դրա մեջ նոր բան ավելացնել չջնջելով նախորդ գրածը
f.write("\nHello, my name is Vahe Khachatryan") # Ավելացնում ենք նշված տեքստը
f.close() # Փակում ենք ֆայլը


try:             # Կիրառվում է, երբ հնարավոր է առաջանա վիճակ, երբ ինչ որ խնդրի պատճառով կոդը չշարունակվի, և նպատակն է տեղեկացնել, որ առկա է խնդիր, և կոդը շարունակել
    a = 10       # Ներմուծում ենք փոփոխականը
    b = 0        # Ներմուծում են փոփոխականը
    print(a/b)   # Կատարում ենք գործողությունը
except ZeroDivisionError:   # Այս հատվածում նշում ենք, թե ինչ տիպի խնդիր կարող է առաջանալ
    print("no")             # Կատարում ենք գործողություն, որը կերևա տվյալ խնդրի առաջացման ժամանակ 