a = int(input("Nomber: ")) # Նախատեսված է ամբողջ թվեր ներմուծելու համար


if a>10 and a<100: # Հիմնական պայման, եթե թիվը մեծ է 10-ից, և միևնույն ժամանակ փոքր է 100-ից կատարել բլոկում գրված գործողությունը։
    print("OK")
elif a>100 and a<200: # Հիմնական պայմաը չբավարարելու դեպքում անցում է կատարվում մյուս պայմանին
    print("Done")
else:                  # Մնացած բոլոր դեպքերում
    print("Well")


if a>10 or a==10: # Հիմնական պայման, եթե թիվը մեծ է 10-ից, կամ հավասար է 10-ի կատարել բլոկում գրված գործողությունը։
    print("OK")
else:                  # Մնացած բոլոր դեպքերում
    print("Well")