l = [1, 2, 3, 4, 5.9, "Hi", 6, 7, [1, 2, 3]] # զանգված

print(l) # ստանում ենք զանգվածը

print(l[0]) # ստանում ենք զանգվածի 0 ինդեքսով տարը, որը առաջին տարրն է

print(l[-1]) # ստանում ենք զանգվածի վերջին տարրը

for i in l: # Ցիկլի միջոցով ստանում ենք զանգվածի բոլոր տարերը առանձին
    print(i)

l.append(80) # append մեթոդով զանգվածի վերջից ավելացնում ենք նոր տարր
print(l)

l.pop() # pop մեթոդով ջնջում ենք զանգվածի վերջին տարրը
print(l)

n = l.index(5.9) # որոշում ենք նշված տարրի ինդեքսը
print(n)

k = len(l) # որոշում ենք զանգվածի երկարությունը, այսինքն թե քանի տարր կա զանգվածում 
print(k)

l1 = [1, 4, 3, 5.8, 67, 2] # զանգված

l2 = ["abc", "cde", "fgl", "bcd"]

l1.sort() # զանգվածը դասավորում է աճման կարգով
print(l1)

l2.sort() # զանգվածը դասավորում է այբենական կարգով
print(l2)

l1.sort(reverse=True) # զանգվածը դասավորում է նվազման կարգով
print(l1)

l1[1] = 18 # զանգվածի նշված ինդեքսով տարրը փոփոխում ենք
print(l1)