l = [1, 2, 3, 4, 5.9, "Hi", 6, 7, [1, 2, 3]] # լիստ

print(l) # ստանում ենք լիստըը

print(l[0]) # ստանում ենք լիստի 0 ինդեքսով տարը, որը առաջին տարրն է

print(l[-1]) # ստանում ենք լիստի վերջին տարրը

for i in l: # Ցիկլի միջոցով ստանում ենք լիստի բոլոր տարերը առանձին
    print(i)

l.append(80) # append մեթոդով լիստի վերջից ավելացնում ենք նոր տարր, արդյունքը չի վերադարձնում
print(l)

l.pop() # pop մեթոդով ջնջում ենք լիստի վերջին տարրը, վերադարձնում է նաև ջնջված տարրը  
print(l)

n = l.index(5.9) # որոշում ենք նշված տարրի ինդեքսը, արդյունքը վերադարձնում է
print(n)

k = len(l) # որոշում ենք լիստի երկարությունը, այսինքն թե քանի տարր կա լիստում, արդյունքը վերադարձնում է
print(k)

l1 = [1, 4, 3, 5.8, 67, 2] # լիստ

l2 = ["abc", "cde", "fgl", "bcd"]

l1.sort() # լիստը դասավորում է աճման կարգով
print(l1)

l2.sort() # լիստը դասավորում է այբենական կարգով, արդյունքը չի վերադարձնում
print(l2)

l1.sort(reverse=True) # լիստը դասավորում է նվազման կարգով, արդյունքը չի վերադարձնում
print(l1)

l1[1] = 18 # լիստի նշված ինդեքսով տարրը փոփոխում ենք
print(l1)

a = [1,2,3,4,5]

b = [5,4,3,2,1]

print(a + b) # Ստանում ենք երկու լիստերի գումարը, այսինքն առաջին լիստի վերջից ավելացնում է երկրորդ լիստը

print(3*a) # Լիստի ներսում երեք անգամ տպվում են լիստի տարրերը

print(a[:2] + a[3:]) # ստանում ենք լիստի առաջին տարրից մինչև երրորդ տարը չվերցրած գումարած չորրորդ տարից մինչև վերջ