t = (1,54,8.7,"Hi",) # կորտեժ, որը տարբերվում է լիստից նրանով, որ այս դեպքում կորտեժի տարրերը անփոփոխ են
print(t) # ստանում ենք կորտեժը

print(t[1]) # ստանում ենք կորտեժի 1 ինդեքսով տարրը, այսինքն 54

a = list(t) # կորտեժը դարձնում է լիստ, վերադարձնում է արդյունքը
print(a)

l = [1,2,3,5,98] # լիստ
b = tuple(l) # լիստը դարձնում է կորտեժ, վերադարձնում է արդյունքը
print(b)

d = {"a":"A","b":"B","c":"C",1:2,3:4} # դիքշընրի, առաջին տարը քին է երկրորդը արժեքը՝ քի։արժեք
print(d)

k = d.keys() # ստանում ենք քիերը, վերադարձնում է արդյունքը լիստի տեսքով
print(k)

v = d.values() # ստանում ենք միայն արժեքները, վերադարձնում է արդյունքը լիստի տեսքով
print(v)

i = d.items() # ստանում ենք և քիերը, և արժեքները իրար կողքի, վերադարձնում է արդյունքը լիստի տեսքով
print(i)

for j in i: # ստանում ենք և քիերը, և արժեքները իրար տակ
    print(j)

print(d["a"]) # ստանում ենք "a" քիի արժեքը այսինքն "A"

d["a"] = 10 # a քիի արժեքը փոխում է 10-ի
print(d)

del(d["b"]) # ջնջում ենք b քին ու նրա արժեքը
print(d)
