t = (1,2,5,9,8,)

l = [1,8,9,6,2,1]

d = {"a":"A","b":"B","c":"C"}


# 1. Տպել կորտեժը և դիքթընրին լիստերը

# print(t)
# print(d)

# 2. t կորտեժը դարձնել լիստ և l լիստը դարձնել կորտեժ

# l1 = list(t)
# print(l1)
# t1 = tuple(l)
# print(t1)

# 3. Տպել կորտեժի երրորդ տարրը

# k = t[2]
# print(k)

# 4 Տպել կորտեժի տարրերի քանակը

# c = len(t)
# print(c)

# 5 Տպել դիքթընրիի բոլոր քիերը

# k = d.keys()
# print(k)

# 6 Տպել դիքթընրիի բոլոր արժեքները

# v = d.values()
# print(v)

# 7 Տպել դիքթընրիի բոլոր արժեքներն ու քիերը

# i = d.items()
# print(i)

# 8 Տպել դիքթընրիի բոլոր արժեքներն ու քիերը կողք կողքի

# for j in d.items():
#    print(j)

# 9 Փոխել "a" քիի արժեքը "F"

# d["a"] = "F"
# print(d)

# 10 Ջնջել "c" քին ու նրա արժեքը
 
del(d["c"])
print(d)
